{"entries": [
  {
    "title": "Entry 1",
    "date": "1 January 2018",
    "content": "This is all new to me. I hope to keep a 'beginner's mind' about it all throughout it all. Hopefully, watching this journey will be illuminating to some. As I will explain in later posts, I do not intend this space to be grounds for dialogue - but if you wish to, I am more than willing in other formats. Here, I will post daily short entries.",
    "tags": ["first-entry", "blog intentions", "what am i doing"]
  },
  {
    "title": "Entry 2",
    "date": "2 January 2018",
    "content": "I don't disclose my ignorance comfortably & easily. That may be surprising as you read more of this blog. I appear to say, often, 'I don't understand'. You will see through this ingenuine admission, though, when you encounter hasty conclusions, convoluted explanations, unprecise defintions, and a mystifying lack of awareness that I can, in fact, Google it. More pointedly, the bad habit I am identifying here is that of putting on airs, of arriving to a realm of knowledge as if it were the most natural thing to me. Academic philosophy and a nagging ego are to blame for that. I intend to kick some of that. Nevertheless, I hope this blog can be a record for how I have come to understand the technical side of web technologies. While I deeply respect my reader, this isn't a conversation. This is my unabashedly solispsitic attempt to understand. Hope you enjoy the struggle.",
    "tags": ["what am i doing", "blog intentions"]
  },
  {
    "title": "Entry 3",
    "date": "3 January 2018",
    "content": "Today, I was warned against rabbit trails. I understood where the concern arose, but still couldn't quite square it. Undoubtedly, curiosity can distract. That doesn't seem to be entirely the case in the context he brought up this point - a learning environment, namely. Normally, we think of curiosity as inspiring learning, as the vehicle driving us to get our hands dirty or engage our minds to expand around new concepts. I wonder, though, if this puts the cart before the horse, not to abuse a metaphor too much. Curiosity, we normally suppose, is the genesis, beginning of learning, whereas I am interested in teasing out the thought if curiosity is, in fact, the end goal. This is in part because curiosity is never complete - it loops out in ever-widening ellipses. More over, we are energized and excited by the unending whys. The five-year-old keeps asking 'why' because she has discovered how invigorating it is to keep asking. Being curious is the desirable end state.",
    "tags": ["learning", "terminology", "what am i doing"]

  },
  {
    "title": "Entry 4",
    "date": "4 January 2018",
    "content": "Idea: a site collecting information on the technology underlying any individual cryptoasset.  Problem: I have not found any single source that helpfully describes how diverse cryptoassets function. What I mean looks to the following problem. In order for a developer, a business, anyone in general to meaningfully compare & contrast the virtues of, say, Bitcoin & Ripple or their underlying assets, one would need to have a general knowledge of blockchain, proof-of-work, etc. Otherwise, one relies on an expert. Especially these days, where proponents of cryptoassets seem more focused on holy wars, one ought to be skeptical of even the most basic definitions being provided. First step: From what I can tell, terminologies between cryptoassets are fairly standard. They draw from the same pool of reserach into cryptography, protocols, and the like. Undoubtedly, they like to call this or that some esoteric proper noun, but that is fluff on top of more fundamental similarities. Confirming this hyothesis would prove the viability of this idea.",
    "tags": ["ideas", "cryptoassets", "bitcoin", "ripple", "blockchain", "proof-of-work"]
  },
  {
    "title": "Entry 5",
    "date": "6 January 2018",
    "content": "One of the reasons I am writing this blog is to also think about and then build from the ground up tools for automating as much as possible - besides the writing of course! Now, there are many tools for blogging out there. Wordpress sites are a great resource, building out a whole UI for people. So, I am reinventing the wheel, but for precise purpose of learning how to make wheels. Fortunately, there are many, many tools available for modern Javascript developers that automate diverse processes. Unfortunately - and I am saying nothing new here - you can't learn much if it's all done for you. Thus, for this blog, it's all starting with a simple shell script that opens a new file while copying over a template so that I can get straight to writing. It's nothing fancy, but I already learned a lot about shell scripting in the process - so progress!",
    "tags": ["what am i doing", "blog intentions", "shell scripting", "learning"]
  }
]}
